

<!DOCTYPE html>
<html lang="null">
<head prefix="og: http://ogp.me/ns#">
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="null">
    <title>Principal Components Analysis | Ored&#39;s blog</title>

    <!-- Open Graph -->
    <meta name="description" content="PCA&amp;#x662F;&amp;#x7528;&amp;#x6765;&amp;#x505A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7684;PCA(&amp;#x4E3B;&amp;#x6210;&amp;#x5206;&amp;#x5206;&amp;#x6790;)&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x53D8;&amp;#x91CF;&amp;#x7684;&amp;#x7EBF;&amp;#x6027;&amp;#x7EC4;&amp;#x5408;&amp;#x6765;&amp;#x63CF;">
<meta property="og:type" content="article">
<meta property="og:title" content="Principal Components Analysis">
<meta property="og:url" content="https://batteryhp.github.io/2017/03/25/PCA/index.html">
<meta property="og:site_name" content="Ored's blog">
<meta property="og:description" content="PCA&amp;#x662F;&amp;#x7528;&amp;#x6765;&amp;#x505A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7684;PCA(&amp;#x4E3B;&amp;#x6210;&amp;#x5206;&amp;#x5206;&amp;#x6790;)&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x53D8;&amp;#x91CF;&amp;#x7684;&amp;#x7EBF;&amp;#x6027;&amp;#x7EC4;&amp;#x5408;&amp;#x6765;&amp;#x63CF;">
<meta property="og:image" content="http://i.imgur.com/94HZzai.jpg">
<meta property="og:updated_time" content="2017-04-04T14:07:52.856Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Principal Components Analysis">
<meta name="twitter:description" content="PCA&amp;#x662F;&amp;#x7528;&amp;#x6765;&amp;#x505A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7684;PCA(&amp;#x4E3B;&amp;#x6210;&amp;#x5206;&amp;#x5206;&amp;#x6790;)&amp;#x662F;&amp;#x901A;&amp;#x8FC7;&amp;#x53D8;&amp;#x91CF;&amp;#x7684;&amp;#x7EBF;&amp;#x6027;&amp;#x7EC4;&amp;#x5408;&amp;#x6765;&amp;#x63CF;">
<meta name="twitter:image" content="http://i.imgur.com/94HZzai.jpg">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:undefined",
  "image": "undefined",
  "name": "Ored He",
  "url": "https://batteryhp.github.io"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="//fonts.useso.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css"><!-- hexo-inject:begin --><!-- hexo-inject:end -->
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>Ored&#39;s blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">Ored He</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-PCA" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    Principal Components Analysis
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <h3 id="PCA&#x662F;&#x7528;&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x7684;"><a href="#PCA&#x662F;&#x7528;&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x7684;" class="headerlink" title="PCA&#x662F;&#x7528;&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x7684;"></a>PCA&#x662F;&#x7528;&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x7684;</h3><p>PCA(&#x4E3B;&#x6210;&#x5206;&#x5206;&#x6790;)&#x662F;&#x901A;&#x8FC7;&#x53D8;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#x6765;&#x63CF;&#x8FF0;&#x8FD9;&#x7EC4;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x5DEE;-&#x534F;&#x65B9;&#x5DEE;&#x7ED3;&#x6784;&#x3002;PCA&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x6709;&#x964D;&#x7EF4;&#x3001;&#x6570;&#x636E;&#x538B;&#x7F29;&#x3001;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x3002;<br><strong>&#x6CE8;&#x610F;&#xFF1A;&#x6570;&#x636E;&#x505A;&#x5B8C;PCA&#x4E4B;&#x540E;&#x5F97;&#x5230;&#x7684;&#x6570;&#x636E;&#x5F62;&#x5F0F;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x4F1A;&#x518D;&#x4FDD;&#x7559;&#x539F;&#x59CB;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x539F;&#x6765;&#x53D8;&#x91CF;&#x7684;&#x7EBF;&#x6027;&#x7EC4;&#x5408;&#xFF0C;&#x800C;&#x662F;&#x539F;&#x59CB;&#x53D8;&#x91CF;&#x7684;&#x6295;&#x5F71;&#x3002;</strong><br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div></pre></td><td class="code"><pre><div class="line">PCA&#x5728;&#x5B9A;&#x4E49;&#x4E0A;&#x6709;&#x4E24;&#x79CD;&#x7406;&#x89E3;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x6570;&#x636E;&#x5728;&#x4F4E;&#x7EF4;&#x7A7A;&#x95F4;&#x4E0A;&#x7684;&#x6B63;&#x4EA4;&#x6295;&#x5F71;&#xFF0C;</div><div class="line">&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x6700;&#x5C0F;&#x5316;&#x539F;&#x59CB;&#x6570;&#x636E;&#x70B9;&#x4E0E;&#x6295;&#x5F71;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x5747;&#x65B9;&#x8DDD;&#x79BB;&#x3002;</div></pre></td></tr></table></figure></p>
<p>&#x4E0A;&#x9762;&#x7684;&#x5B9A;&#x4E49;&#x5F15;&#x81EA;PRML chapter12.&#x5176;&#x5B9E;&#xFF0C;&#x4ECE;&#x53D9;&#x8FF0;&#x4E0A;&#x770B;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x601D;&#x2026;<br>&#x4E0B;&#x9762;&#x770B;&#x770B;&#x8FD9;&#x51E0;&#x4E2A;&#x76EE;&#x7684;&#xFF1A;</p>
<ol class="ui list">
<li>&#x6570;&#x636E;&#x964D;&#x7EF4;&#x3002;&#x539F;&#x59CB;&#x6570;&#x636E;&#x5982;&#x679C;&#x662F; \( p \) &#x7EF4;&#xFF0C;&#x73B0;&#x5728;&#x9009;&#x62E9; \( k \) &#x4E2A;&#x4E3B;&#x6210;&#x5206;&#xFF0C;&#x663E;&#x7136;&#x8FBE;&#x5230;&#x4E86;&#x964D;&#x7EF4;&#x7684;&#x76EE;&#x7684;&#x3002;</li>
<li>&#x6570;&#x636E;&#x538B;&#x7F29;&#x3002;&#x539F;&#x672C; \( p \) &#x7EF4;&#x89C2;&#x6D4B;&#x6570;&#x636E;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x8981;&#x89C2;&#x5BDF; \( k \) &#x4E2A;&#x4E3B;&#x6210;&#x5206;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</li>
<li>&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x3002;&#x5C06;&#x4E3B;&#x6210;&#x5206;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#x8F93;&#x5165;&#x6A21;&#x578B;&#x3002;</li>
<li>&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x3002;&#x5F80;&#x5F80;&#x5728;&#x521A;&#x62FF;&#x5230;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x60F3;&#x753B;&#x4E2A;&#x56FE;&#x770B;&#x4E00;&#x4E0B;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x53EF;&#x80FD;&#x6570;&#x636E;&#x7EF4;&#x6570;&#x8FC7;&#x9AD8;&#xFF0C;&#x5BFC;&#x81F4;&#x753B;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x7528;PCA&#x964D;&#x5230;2&#x7EF4;&#x6216;&#x8005;3&#x7EF4;&#x753B;&#x56FE;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x633A;&#x5B9E;&#x7528;&#x7684;&#x3002;  </li>
</ol>
<p>&#x53E6;&#x5916;&#xFF0C;&#x65E2;&#x7136;&#x6700;&#x540E;&#x7684;&#x4E3B;&#x6210;&#x5206;&#x662F;&#x6B63;&#x4EA4;&#x6295;&#x5F71;&#xFF0C;&#x90A3;&#x4E48;PCA &#x8FD8;&#x6709;&#x4E00;&#x5C42;&#x610F;&#x601D;&#xFF1A;&#x5C06;&#x539F;&#x6765;&#x5F88;&#x53EF;&#x80FD;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x7684;&#x6570;&#x636E;&#x53D8;&#x6210;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x7684;&#x6570;&#x636E;&#x3002;<br>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x53D9;&#x8FF0;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;PCA&#x66F4;&#x591A;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x7684;&#x3002;&#x5728;&#x56E0;&#x5B50;&#x5206;&#x6790;&#x3001;&#x805A;&#x7C7B;&#x7B49;&#x65B9;&#x6CD5;&#x4E0A;&#x90FD;&#x7528;&#x5F97;&#x5230;&#x3002;<br>$$<br>    \begin{equation}<br>        {\hat \beta}^{ridge} = {\mathop{\arg {\min_{\beta}}}} \left\{ \sum \limits_{i=1} ^{N}(y_i-\beta_0- \sum \limits_{j=1} ^{p}x_{ij}\beta_j )^2 + \lambda \sum \limits_{j=1} ^{p}\beta_{j}^2 \right\}<br>    \end{equation}  $$ </p>
<h3 id="PCA"><a href="#PCA" class="headerlink" title="PCA"></a>PCA</h3><h4 id="PCA&#x7684;&#x601D;&#x60F3;"><a href="#PCA&#x7684;&#x601D;&#x60F3;" class="headerlink" title="PCA&#x7684;&#x601D;&#x60F3;"></a>PCA&#x7684;&#x601D;&#x60F3;</h4><p>&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x7EC8;&#x4E8E;&#x60F3;&#x660E;&#x767D;&#x4E86;&#x4E00;&#x70B9;&#x4EC0;&#x4E48;&#x662F;PCA&#xFF0C;&#x770B;&#x80FD;&#x4E0D;&#x80FD;&#x8BF4;&#x6E05;&#x695A;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x7814;&#x7A76;&#x4E00;&#x4E2A;&#x95EE;&#x9898;(&#x6BD4;&#x5982;&#x8BBE;&#x7F6E;&#x4E3A; \( y \))&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x627E;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x56E0;&#x7D20;(&#x6BD4;&#x5982;&#x8BBE;&#x7F6E;&#x4E3A; \( \boldsymbol{x} \))&#xFF0C;&#x968F;&#x540E;&#x53BB;&#x641C;&#x96C6;&#x548C;&#x751F;&#x4EA7; \( y \) &#x548C; \( \boldsymbol{x} \) &#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x5EFA;&#x7ACB;&#x6A21;&#x578B;&#x5E76;&#x6C42;&#x89E3;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x95EE;&#x9898;&#xFF1A; \( \boldsymbol{x} \) &#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5408;&#x9002;&#x9AD8;&#x6548;&#x5730;&#x63CF;&#x8FF0;  &#x4E0E; \( y \) &#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x56E0;&#x7D20; \( \boldsymbol{x} \) &#x4F53;&#x73B0;&#x4E86;&#x6211;&#x4EEC;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x4E0D;&#x662F;&#x6700;&#x9AD8;&#x6548;&#x5730;&#x5F71;&#x54CD; \( y \) &#x7684;&#x56E0;&#x7D20;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x627E;&#x5230;&#x6700;&#x597D;&#x5730;&#x5F71;&#x54CD; \( y \) &#x7684;&#x56E0;&#x7D20;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x80FD;&#x6536;&#x96C6;&#x5230;&#x7684;&#x6216;&#x8005;&#x662F;&#x6536;&#x96C6;&#x5230;&#x7684;&#x6570;&#x636E;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x5C31;&#x7B80;&#x79F0;&#x4E3A;<strong>&#x6F5C;&#x5728;&#x56E0;&#x7D20;</strong>(&#x8BB0;&#x4E3A; \( \boldsymbol{v} \) )&#x5427;&#xFF0C;&#x8FD9;&#x4E9B;&#x6F5C;&#x5728;&#x56E0;&#x7D20;&#x6700;&#x597D;&#x662F;&#x6709;<strong>&#x6570;&#x91CF;&#x5C11;&#x3001;&#x76F8;&#x5173;&#x6027;&#x4F4E;</strong>&#x7684;&#x7279;&#x70B9;&#x3002;<strong>PCA</strong>&#x5C31;&#x662F;&#x5BFB;&#x627E;&#x8FD9;&#x4E9B;&#x6F5C;&#x5728;&#x56E0;&#x7D20;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x5F53;&#x7136;&#x524D;&#x63D0;&#x662F; \( y \) &#x4E0E; \( \boldsymbol{v} \)&#x3001;\( y \) &#x4E0E; \( \boldsymbol{x} \) &#x662F;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#x3002;&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5728;PRML&#x4E2D;&#xFF0C;PCA&#x653E;&#x5728;&#x4E86;12&#x7AE0; <em>Continuous Latent Variables</em> &#x4E2D;&#x3002;&#x65E2;&#x7136; \( \boldsymbol{v} \) &#x7684;&#x7EF4;&#x6570;&#x8D8A;&#x4F4E;&#x8D8A;&#x597D;&#x3001;&#x5404;&#x5206;&#x91CF;&#x4E4B;&#x95F4;&#x76F8;&#x5173;&#x6027;&#x8D8A;&#x4F4E;&#x8D8A;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x5404;&#x5206;&#x91CF;&#x9700;&#x8981;&#x8574;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x5C31;&#x5E94;&#x8BE5;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#x3002;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x8574;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x8F83;&#x76F4;&#x89C2;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x79CD;&#x5C31;&#x662F;<strong>&#x65B9;&#x5DEE;</strong>&#x3002;&#x8BD5;&#x60F3;&#xFF0C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x53D6;&#x503C;&#x8D8A;&#x5206;&#x6563;&#x3001;&#x6CE2;&#x52A8;&#x6027;&#x8D8A;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x610F;&#x4E49;&#x4E5F;&#x5C31;&#x8D8A;&#x5927;&#xFF0C;&#x76F8;&#x53CD;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53EA;&#x53D6;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x53BB;&#x6389;&#x5B83;&#x53EF;&#x80FD;&#x53C8;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x53D6;&#x65B9;&#x5DEE;&#x6700;&#x5927;&#x7684;&#x7279;&#x5F81;&#xFF1F;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x6211;&#x4EEC;&#x628A; \( \boldsymbol{x} \) &#x7684;&#x5404;&#x4E2A;&#x5206;&#x91CF;&#x90FD;&#x7B97;&#x4E00;&#x4E0B;&#x65B9;&#x5DEE;&#xFF0C;&#x628A;&#x65B9;&#x5DEE;&#x5927;&#x7684;&#x7559;&#x7740;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x505A;&#x6709;&#x7F3A;&#x9677;&#xFF1A;&#x4E00;&#x662F;&#x5230;&#x5E95;&#x9009;&#x591A;&#x5C11;&#x5408;&#x9002;&#xFF0C;&#x4E8C;&#x662F;&#x9009;&#x51FA;&#x7684;&#x53D8;&#x91CF;&#x53EF;&#x80FD;&#x76F8;&#x5173;&#x6027;&#x592A;&#x5F3A;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4ECB;&#x7ECD;&#x7684;PCA&#x5E76;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x9009;&#x53D6;&#x51E0;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684; \( \boldsymbol{x} \) &#x5206;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x627E;&#x5230;<strong>&#x6F5C;&#x5728;&#x7684;&#x3001;&#x539F;&#x59CB;&#x53D8;&#x91CF;&#x7EC4;&#x5408;&#x800C;&#x6765;&#x7684;&#x56E0;&#x7D20;</strong>&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="PCA&#x7684;&#x51E0;&#x4F55;&#x8868;&#x793A;"><a href="#PCA&#x7684;&#x51E0;&#x4F55;&#x8868;&#x793A;" class="headerlink" title="PCA&#x7684;&#x51E0;&#x4F55;&#x8868;&#x793A;"></a>PCA&#x7684;&#x51E0;&#x4F55;&#x8868;&#x793A;</h4><p>&#x4E0A;&#x9762;&#x8BF4;&#x4E86;PCA&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4ECE;<strong>&#x51E0;&#x4F55;&#x89D2;&#x5EA6;</strong>&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x9009;&#x53D6;&#x5305;&#x542B;&#x4FE1;&#x606F;&#x591A;&#x5373;&#x65B9;&#x5DEE;&#x5927;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x624B;&#x91CC;&#x6709;&#x7684;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x4E00;&#x4E2A; \( m \times n \) &#x9636;&#x6570;&#x636E;&#x77E9;&#x9635; \( \boldsymbol{X}\)&#xFF0C;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x7684;&#x884C;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x5217;&#x4EE3;&#x8868;&#x53D8;&#x91CF;(&#x7279;&#x5F81;)&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5047;&#x5B9A; \( \boldsymbol{X}\) &#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5728;&#x6B27;&#x5F0F;&#x51E0;&#x4F55;&#x7A7A;&#x95F4; \( \boldsymbol{R}^n \) &#x4E2D;&#x7684;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x70B9;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x3002;<strong>&#x6211;&#x60F3;&#x4E86;&#x5F88;&#x4E45;&#x8868;&#x793A;&#xFF1A;&#x8FD9;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5F3A;&#x7684;&#x5047;&#x5B9A;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x641C;&#x96C6;&#x5230;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x7684;&#x3002;</strong>&#x7A0D;&#x540E;&#x6211;&#x518D;&#x8BF4;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5047;&#x5B9A;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;PCA&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x5148;&#x627F;&#x8BA4;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x3002;PCA&#x60F3;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x5E73;&#x79FB;&#x3001;&#x65CB;&#x8F6C;&#x8FD9;&#x4E2A;&#x5750;&#x6807;&#x7CFB;&#xFF0C;&#x8BA9;&#x5750;&#x6807;&#x8F74;&#x843D;&#x5728;&#x6570;&#x636E;&#x6700;&#x5206;&#x6563;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x3002;&#x5982;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4E8C;&#x7EF4;&#x56FE;<br><a class="magnific-img" href="http://i.imgur.com/94HZzai.jpg"><img src="http://i.imgur.com/94HZzai.jpg" alt="" class="ui centered image"></a><br>&#x5982;&#x4E0A;&#x56FE;&#xFF0C;&#x5750;&#x6807;&#x7CFB;&#x7ECF;&#x8FC7;&#x5E73;&#x79FB;&#x3001;&#x65CB;&#x8F6C;&#x4E4B;&#x540E;&#xFF0C;\( F_1 \) &#x627F;&#x62C5;&#x4E86;&#x6570;&#x636E;&#x7684;&#x5927;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x7B80;&#x5316;&#x95EE;&#x9898; \( F_2 \) &#x8FD9;&#x4E00;&#x7EF4;&#x5C31;&#x53EF;&#x4EE5;&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x81EA;&#x7136;&#x800C;&#x7136;&#x5C31;&#x8FBE;&#x5230;&#x4E86;&#x964D;&#x7EF4;&#x5E76;&#x4E14;&#x8FD8;&#x5C3D;&#x91CF;&#x4FDD;&#x7559;&#x539F;&#x59CB;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x7684;&#x76EE;&#x7684;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x7EF4;&#x6570;&#x5927;&#x4E8E;2&#x7EF4;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x662F;&#x5C06;&#x539F;&#x6765;&#x7684;&#x6B63;&#x4EA4;&#x5750;&#x6807;&#x7CFB;&#x505A;&#x7684;&#x5E73;&#x79FB;&#x3001;&#x65CB;&#x8F6C;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x540E;&#x964D;&#x7EF4;&#x540E;&#x7684;&#x6570;&#x636E;&#x662F;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x7684;&#x3002; &#x6211;&#x4EEC;&#x770B;&#x964D;&#x7EF4;&#x4E4B;&#x540E;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x65F6;&#x7684;&#x53D8;&#x91CF;(\( F_1 \) &#x548C; \( F_2 \) )&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x539F;&#x59CB;&#x53D8;&#x91CF;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x539F;&#x6765;&#x53D8;&#x91CF;&#x7684;&#x4E00;&#x79CD;&#x7EC4;&#x5408;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x627E;&#x5230;&#x7684;<strong>&#x6F5C;&#x5728;&#x53D8;&#x91CF;</strong>&#x3002;<br>&#x6211;&#x8BF4;&#x4E00;&#x4E0B;&#x4E0A;&#x9762;&#x90A3;&#x4E2A;<strong>&#x539F;&#x59CB;&#x53D8;&#x91CF;&#x5747;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x7684;</strong>&#x7684;&#x5047;&#x5B9A;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x60F3;&#x6CD5;&#x4E0D;&#x4E00;&#x5B9A;&#x5BF9;&#x3002;&#x6211;&#x4EEC;&#x641C;&#x96C6;&#x5230;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x5982;&#x679C;&#x60F3;&#x628A;&#x4ED6;&#x4EEC;&#x7528;&#x51E0;&#x4F55;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;&#x6700;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x7684;&#x5C31;&#x662F;&#x628A;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5750;&#x6807;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;&#x8FD9;&#x4E2A;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x5750;&#x6807;&#x7CFB;&#x5982;&#x4F55;&#x6784;&#x9020;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5904;&#x7406;&#x3001;&#x6CA1;&#x6709;&#x7814;&#x7A76;&#x6570;&#x636E;&#x5185;&#x5728;&#x89C4;&#x5F8B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5047;&#x5B9A;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#xFF0C;&#x5373;&#x5EFA;&#x7ACB;&#x6B63;&#x4EA4;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x4E2D;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x5982;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x53D8;&#x91CF;&#x4E2D; \( x_1 \) &#x548C; \( x_2 \) &#x6EE1;&#x8DB3; \( x_1 = C \times x_2 \) &#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x7EF4;&#x5750;&#x6807;&#x5C31;&#x53EF;&#x4EE5;&#x8868;&#x793A; \( x_1 \) &#x548C; \( x_2 \) &#x4E86;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x81E3;&#x59BE;&#x505A;&#x4E0D;&#x5230;&#x554A;&#xFF01;&#x8FD9;&#x4E48;&#x591A;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x54EA;&#x91CC;&#x77E5;&#x9053;&#x8C01;&#x8DDF;&#x8C01;&#x76F8;&#x5173;&#xFF1F;&#xFF01;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x7C97;&#x66B4;&#x5730;&#x8BA4;&#x4E3A;&#x5404;&#x4E2A;&#x5206;&#x91CF;&#x65E0;&#x5173;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5728;&#x627E;&#x6F5C;&#x5728;&#x53D8;&#x91CF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x81EA;&#x7136;&#x800C;&#x7136;&#x53EF;&#x4EE5;&#x65CB;&#x8F6C;&#x5750;&#x6807;&#x7CFB;&#x800C;&#x4E0D;&#x7528;&#x518D;&#x8FDB;&#x884C;&#x6B63;&#x4EA4;&#x5316;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x540E;&#x679C;&#xFF0C;&#x5C31;&#x662F;&#x7EF4;&#x6570;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x591A;(\( n \)&#x7EF4;)&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5F71;&#x54CD;PCA&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5C31;&#x62FF; \( x_1 = C \times x_2 \) &#x6765;&#x8BF4;&#xFF0C;&#x672C;&#x6765;&#x4E00;&#x7EF4;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x753B;&#x5728;&#x4E8C;&#x7EF4;&#x5E73;&#x9762;&#x4E0A;(\( x_1 \) &#x548C; \( x_2 \)&#x7EC4;&#x6210;&#x7684;&#x4E8C;&#x7EF4;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;)&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x65CB;&#x8F6C;&#x554A;&#xFF0C;&#x628A;&#x5176;&#x4E2D;&#x4E00;&#x7EF4;&#x5750;&#x6807;&#x8F74;&#x4E0E;&#x8FD9;&#x6761;&#x76F4;&#x7EBF;&#x91CD;&#x5408;&#xFF0C;&#x53E6;&#x4E00;&#x7EF4;&#x5220;&#x9664;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;<strong>&#x6570;&#x636E;&#x5C31;&#x662F;&#x5B83;&#x539F;&#x6765;&#x7684;&#x6A21;&#x6837;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x7528;&#x4EC0;&#x4E48;&#x5750;&#x6807;&#x7CFB;&#x8868;&#x793A;&#xFF0C;&#x4E0D;&#x7BA1;&#x7528;&#x4EC0;&#x4E48;&#x5DE5;&#x5177;&#x53BB;&#x770B;&#x5B83;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5B83;&#x81EA;&#x5DF1;&#x3002;</strong></p>
<h4 id="PCA&#x7684;&#x8BA1;&#x7B97;"><a href="#PCA&#x7684;&#x8BA1;&#x7B97;" class="headerlink" title="PCA&#x7684;&#x8BA1;&#x7B97;"></a>PCA&#x7684;&#x8BA1;&#x7B97;</h4><p>&#x4E0B;&#x9762;&#x5199;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x628A;<strong>&#x6F5C;&#x5728;&#x53D8;&#x91CF; \( \boldsymbol{v} \) </strong>&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x786E;&#x5B9A; \( \boldsymbol{v} \) &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x5C06;&#x6570;&#x636E;&#x6700;&#x5206;&#x6563;&#x7684;&#x65B9;&#x5411;&#x627E;&#x5230;&#x4F5C;&#x4E3A; \( \boldsymbol{v} \) &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5206;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x6570;&#x636E;&#x7B2C;&#x4E8C;&#x5206;&#x6563;&#x7684;&#x65B9;&#x5411;&#x4F5C;&#x4E3A; \( \boldsymbol{v} \) &#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5206;&#x91CF;&#xFF0C;&#x4F9D;&#x6B21;&#x7C7B;&#x63A8;&#xFF0C;&#x76F4;&#x5230;&#x2026;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x627E;&#x4E86;&#x6216;&#x8005;&#x6EE1;&#x8DB3;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#x3002;&#x4E0B;&#x9762;&#x5148;&#x627E;&#x7B2C;&#x4E00;&#x7EF4;&#x8BD5;&#x8BD5;&#xFF0C;&#x770B;&#x6709;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#x3002;<br>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5728; \( n \) &#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C; \( \boldsymbol{v} \) &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5206;&#x91CF;&#x7684;&#x65B9;&#x5411;&#x7528; \( \boldsymbol{v}_1 \) &#x8868;&#x793A;(&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x7684; \( \boldsymbol{v}_1 \) &#x4ECD;&#x7136;&#x662F; \( n \) &#x7EF4;)&#xFF0C;&#x5E76;&#x4E14;&#x6EE1;&#x8DB3; \( \boldsymbol{v}_{1}^T\boldsymbol{v}_{1}=1 \)&#x3002;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x7684;&#x6837;&#x672C; \( \boldsymbol{x}_{i} \) &#xFF0C;&#x5176;&#x5728; \( \boldsymbol{v}_1 \) &#x4E0A;&#x7684;&#x6295;&#x5F71;&#x4E3A; \( \boldsymbol{v}_{1}^T\boldsymbol{x}_{i} \)&#xFF0C;&#x6240;&#x6709;&#x6837;&#x672C;&#x7684;&#x4E2D;&#x5FC3;&#x5728; \( \boldsymbol{v}_1 \) &#x4E0A;&#x7684;&#x6295;&#x5F71;&#x4E3A;  \( \boldsymbol{v}_{1}^T\bar{\boldsymbol{x}} \)&#xFF0C;&#x5176;&#x4E2D;</p>
<p>$$<br>    \begin{equation}<br>         \bar{\boldsymbol{x}} = \frac{1}{m}\sum_{i=1}^m \boldsymbol{x}_{i}<br>    \end{equation}  $$ </p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x6240;&#x6709;&#x6570;&#x636E;&#x5728; \( \boldsymbol{v}_1 \) &#x4E0A;&#x7684;&#x6295;&#x5F71;&#x7684;&#x65B9;&#x5DEE;&#x4E3A;</p>
<p>$$<br>    \begin{equation}<br>         \bar{\boldsymbol{x}} = \frac{1}{m}\sum_{i=1}^m \{ \boldsymbol{v}_{1}^T\boldsymbol{x}_{i}-\boldsymbol{v}_{1}^T\bar{\boldsymbol{x}}\}^2=\boldsymbol{v}_{1}^T\boldsymbol{S}\boldsymbol{v}_{1}<br>    \end{equation}  $$ </p>
<p>&#x5176;&#x4E2D;&#xFF0C;</p>
<p>$$<br>    \begin{equation}<br>         \boldsymbol{S}=\frac{1}{m}\sum_{i=1}^m (\boldsymbol{x}_{i}-\bar{\boldsymbol{x}})(\boldsymbol{x}_{i}-\bar{\boldsymbol{x}})^T<br>    \end{equation}  $$ </p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x628A;&#x6570;&#x636E;&#x77E9;&#x9635; \( \boldsymbol{X}\) &#x7684;&#x4E00;&#x5217;&#x4E2D;&#x5FC3;&#x5316;(&#x5373;&#x628A;&#x6BCF;&#x4E2A;&#x539F;&#x59CB;&#x5206;&#x91CF;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5316;)&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x5217;&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x51CF;&#x53BB;&#x8FD9;&#x4E00;&#x5217;&#x7684;&#x5747;&#x503C;&#x3002;&#x4ECE;&#x51E0;&#x4F55;&#x4E0A;&#x770B;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5E73;&#x79FB;&#x5230;&#x539F;&#x70B9;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5316;&#x8FD0;&#x7B97;&#x7684;&#x65B9;&#x6CD5;&#x3002;<br>&#x8981;&#x8BA1;&#x7B97; \( \boldsymbol{v} \) &#xFF0C;&#x8003;&#x8651;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4E00;&#x662F; \( \boldsymbol{v} \) &#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x4E8C;&#x662F; \( \boldsymbol{v} \) &#x5404;&#x5206;&#x91CF;&#x627E;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x5F97;&#x5230;&#x6570;&#x636E;&#x77E9;&#x9635;\( \boldsymbol{X} \)&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;&#x5148;&#x786E;&#x8BA4;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x7279;&#x5F81;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x6E29;&#x5EA6;&#x3001;&#x538B;&#x529B;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x7EC4;&#x6210;&#x4E86;\( \boldsymbol{X} \)&#x7684;&#x5217;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53BB;&#x83B7;&#x53D6;&#x6837;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x5F97;&#x5230;&#x5F88;&#x591A;&#x6837;&#x672C;&#x7EC4;&#x6210;\( \boldsymbol{X} \)&#x7684;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7528;&#x51E0;&#x4F55;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x8868;&#x793A;&#x5462;&#xFF1F;&#x5148;&#x770B;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;\( n \)&#x7EF4;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#xFF0C;&#x6BCF;&#x4E00;&#x7EF4;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#xFF0C;&#x6837;&#x672C;&#x6BCF;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x503C;&#x5BF9;&#x5E94;&#x4E8E;&#x8FD9;&#x4E00;&#x7EF4;&#x7684;&#x5750;&#x6807;&#x503C;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x81EA;&#x7136;&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x8BDD;&#x6709;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x7684;&#x524D;&#x63D0;&#xFF1A;&#x8FD9;\( n \)&#x7EF4;&#x7279;&#x5F81;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x786E;&#x8BA4;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x7279;&#x5F81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BA9;&#x5404;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x5747;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x4E24;&#x4E2A;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x5230;&#x5E95;&#x662F;&#x76F8;&#x5173;&#x8FD8;&#x662F;&#x4E0D;&#x76F8;&#x5173;&#xFF0C;&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x662F;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x8868;&#x793A;&#x5462;&#xFF1F;&#x6709;&#x7684;&#x540C;&#x5B66;&#x8BF4;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x770B;&#x54EA;&#x4E9B;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#xFF0C;&#x628A;&#x7EBF;&#x6027;&#x76F8;&#x5173;&#x7684;&#x53BB;&#x6389;&#x4E00;&#x4E9B;&#xFF0C;&#x7528;&#x5269;&#x4E0B;&#x7684;&#x90A3;&#x4E9B;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x7684;&#x7279;&#x5F81;&#x5EFA;&#x7ACB;&#x5750;&#x6807;&#x7CFB;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x4E0A;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x7279;&#x5F81;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x65F6;&#x5019;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5F53;&#x7B2C;&#x4E09;&#x4E2A;&#x7279;&#x5F81;&#x8DDF;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x548C;&#x76F8;&#x5173;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x2026;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x53EF;&#x64CD;&#x4F5C;&#x3002;&#x518D;&#x6709;&#xFF0C;&#x6211;&#x4EEC;&#x641C;&#x96C6;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x6570;&#x636E;&#x662F;&#x4E3A;&#x4E86;&#x7814;&#x7A76;&#x8FD9;&#x4E9B;&#x7279;&#x5F81;&#x5BF9;&#x5173;&#x5FC3;&#x7684;&#x4E8B;&#x4EF6;&#x6709;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF0C;&#x6BD4;&#x5982;&#x5F71;&#x54CD;&#x80A1;&#x7968;&#x6DA8;&#x8DCC;&#xFF0C;&#x4E5F;&#x8BB8;&#x80A1;&#x7968;&#x7684;&#x6DA8;&#x8DCC;&#x8DDF;&#x6211;&#x4EEC;&#x641C;&#x96C6;&#x7684;&#x7279;&#x5F81;&#x5E76;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x662F;&#x8DDF;&#x6BD4;&#x5982;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x7279;&#x5F81;&#x7684;&#x548C;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x60F3;&#x627E;&#x51FA;&#x7279;&#x5F81;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;&#x518D;&#x53BB;&#x505A;&#x7CBE;&#x7B80;&#x662F;&#x4E0D;&#x5408;&#x9002;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x4E0A;&#x9762;&#x7684;\( n \)&#x7EF4;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#x4EE5;&#x539F;&#x70B9;&#x4E3A;&#x4E2D;&#x5FC3;&#x8F6C;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x4E86;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x4E09;&#x7EF4;&#x76F4;&#x89D2;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x70B9;&#x90FD;&#x843D;&#x5728;&#x8FC7;&#x539F;&#x70B9;&#x4E14;&#x4E0D;&#x4E0E;&#x4EFB;&#x610F;&#x5750;&#x6807;&#x5E73;&#x9762;&#x5E73;&#x884C;&#x7684;&#x5E73;&#x9762;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x70B9;&#x7684;&#x5750;&#x6807;&#x5C31;&#x662F;\( (x_1,x_2,x_3) \)&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x5750;&#x6807;&#x7CFB;&#x65CB;&#x8F6C;&#x4E00;&#x4E0B;&#xFF0C;&#x8BA9;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x70B9;&#x843D;&#x5728;\( X_1-X_2 \)&#x5E73;&#x9762;&#x4E0A;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6BCF;&#x4E2A;&#x70B9;&#x7684;&#x5750;&#x6807;&#x5C31;&#x662F;\( (w_1,w_2,0) \)</p>
<p>&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x7BA1;&#x7528;&#x4EC0;&#x4E48;&#x5750;&#x6807;&#x7CFB;&#x53BB;&#x8868;&#x793A;&#xFF0C;&#x5B83;&#x8FD8;&#x662F;&#x6309;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#x7740;&#x3002;<br> <strong>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x662F;&#x81EA;&#x7136;&#x7684;&#x5462;&#xFF1F;</strong>&#x6211;&#x89C9;&#x5F97;&#x5E76;&#x4E0D;&#x662F;&#x3002;&#x9996;&#x5148;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6570;&#x636E;&#x753B;&#x5230;\( n \)&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x9ED8;&#x8BA4;&#x8FD9;\( n \)&#x4E2A;&#x7279;&#x5F81;&#x662F;&#x7EBF;&#x6027;&#x65E0;&#x5173;&#x7684;&#x3002;</p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-03-25T12:25:26.882Z" itemprop="datePublished">2017-03-25</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a class="ui tiny button disabled"><i class="angle left icon"></i>Previous</a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2017/03/03/Ridge-Regression-and-Lasso/" class="ui tiny button">
                    
                    Ridge Regression and Lasso
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#PCA是用来做什么的"><span>PCA是用来做什么的</span></a></li><li><a href="#PCA"><span>PCA</span></a><ol><li><a href="#PCA的思想"><span>PCA的思想</span></a></li><li><a href="#PCA的几何表示"><span>PCA的几何表示</span></a></li><li><a href="#PCA的计算"><span>PCA的计算</span></a></li></ol></li></ol>
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2017 <a href="/">Ored He</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->



</body>
</html>
